// Задача №1

//Задайте массив. Напишите программу, которая определяет,
// присутствует ли заданное число в массиве. Программа
// должна выдать ответ: Да/Нет.
// Примеры
// [1 3 4 19 3], 8 => Нет
// [-4 3 4 1], 3 => Да

// 1)тип данных
// 2) []- обозначение масссива. мы показываем, что задаем не число, а массив
// 3) имя массива
// 4) = присваиваем значение
// 5) само значение

int[] array = { 11, 22, 33, 44, 55, 66, 77, 88, 99 };
int numberForSearch = 44;

// точка старта? условие, переход к след. элементу (увеличение переменной счетчика)
for (int i = 0; i < array.Lenght; i++)
{

}
 
